n5/src/Documents/TenantOrder/TenantOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantOrder</name>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>AccessPrice</name>
    <type>
      <types>DefinedType.Price</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BonusPercent</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>MonthsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PromoCodeDiscount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>UsersCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

n5/src/Documents/TenantPayment/TenantPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TenantPayment</name>
  <registerRecords>AccumulationRegister.Agents</registerRecords>
  <registerRecords>AccumulationRegister.Tenants</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>TenantOrder</name>
    <type>
      <types>DocumentRef.TenantOrder</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/CommonModules/CloudPayments/Module.bsl
Function GetInfo () export
	
	q = new Query ();
	q.Text = getUsersSql () + ";"
	+ getPaidUsersSql () + ";"
	+ getEndOfTrialPeriodSql ();
	q.SetParameter ( "Tenant", SessionParameters.Tenant );
	today = BegOfDay ( CurrentSessionDate () );
	q.SetParameter ( "Today", today );
	SetPrivilegedMode ( true );
	data = q.ExecuteBatch ();
	usersRow = data [ 0 ].Unload () [ 0 ];
	paidUsersTable = data [ 1 ].Unload ();
	endOfTrialPeriodRow = data [ 2 ].Unload () [ 0 ];
	SetPrivilegedMode ( false );
	result = new Structure ();
	result.Insert ( "UsersCount", usersRow.Count );
	paidUsersCount = paidUsersTable [ 0 ];
	result.Insert ( "PaidUsersCount", ? ( paidUsersCount.Count = null, 0, paidUsersCount.Count ) );
	result.Insert ( "EndOfTrialPeriod", endOfTrialPeriodRow.EndOfTrialPeriod );
	result.Insert ( "Today", today );
	result.Insert ( "Info", Cloud.Info () );
	result.Insert ( "System", Connections.IsDemo () or Logins.Sysadmin () );
	return result;
	
EndFunction 

Function getUsersSql ()
	
	s = "
	|select count ( Ref ) as Count
	|from Catalog.Users as Users
	|where not Users.IsFolder
	|and not Users.DeletionMark
	|and not Users.AccessDenied
	|";
	return s;
	
EndFunction 

Function getPaidUsersSql ()
	
	s = "
	|select sum ( TenantOrders.UsersCount ) as Count
	|from Document.TenantOrder as TenantOrders
	|	//
	|	// TenantPayments
	|	//
	|	join Document.TenantPayment as TenantPayments
	|	on TenantPayments.TenantOrder = TenantOrders.Ref
	|	and TenantPayments.Posted
	|where endofperiod ( &Today, day ) between TenantOrders.Date and TenantOrders.DateEnd
	|and TenantOrders.Tenant = &Tenant
	|and not TenantOrders.DeletionMark
	|";
	return s;
	
EndFunction 

Function getEndOfTrialPeriodSql ()
	
	s = "
	|select Tenants.EndOfTrialPeriod as EndOfTrialPeriod
	|from Catalog.Tenants as Tenants
	|where Ref = &Tenant
	|";
	return s;
	
EndFunction 

Function UserCanPay () export
	
	return IsInRole ( "Administrator" );
	
EndFunction
